[
    {
        "id": "0",
        "title": "Kasa - Plateforme de location",
        "images": [
            "images/kasa.png",
            "images/kasa-2.png",
            "images/kasa-3.png"
        ],
        "technologies": [
            "React",
            "React Router DOM",
            "SCSS",
            "JavaScript"
        ],
        "description": "KASA est un projet de développement d'une application web de type Airbnb, où j'ai conçu le front-end en utilisant React. L'objectif était de créer des composants réutilisables pour gérer l'affichage des logements, les détails des annonces et les interactions des utilisateurs. Le routage a été géré avec React Router DOM pour une navigation fluide entre les différentes pages de l'application. Ce projet m'a permis de mettre en pratique les bonnes pratiques de développement React tout en assurant une interface moderne et maintenable.",
        "links": [
            {
                "url": "https://github.com/jo8dev/kasa",
                "label": "GitHub"
            }
        ]
    },
    {
        "id": "1",
        "title": "Sophie Bluel - Architecte d'intérieur",
        "images": [
            "images/sophie-bluel.png",
            "images/sophie-bluel-2.png",
            "images/sophie-bluel-3.png"
        ],
        "technologies": [
            "JavaScript",
            "Fetch API",
            "JWT",
            "HTML",
            "CSS",
            "Notion",
            "Figma"
        ],
        "description": "Sophie Bluel est un projet de création d'une page web dynamique pour un architecte d'intérieur. J'ai développé la page de présentation des travaux de l'architecte, en utilisant JavaScript pour gérer les événements utilisateurs et manipuler le DOM. J'ai également créé une page de connexion pour l'administrateur et une modale pour l'upload de nouveaux médias. Ce projet m'a permis de renforcer mes compétences en gestion des interactions utilisateurs et en communication avec une API.",
        "links": [
            {
                "url": "https://github.com/Jo8Dev/Portfolio-architecte-sophie-bluel",
                "label": "GitHub"
            }
        ]
    },
    {
        "id": "2",
        "title": "Mon vieux grimoire",
        "images": [
            "images/mvg.png",
            "images/mvg-2.png",
            "images/mvg-3.png"
        ],
        "technologies": [
            "NodeJs",
            "JavaScript",
            "MongoDB",
            "Mongoose",
            "Express",
            "JWT",
            "Bcrypt"
        ],
        "description": "Mon Vieux Grimoire est une application web que j'ai développée dans le cadre de ma formation OpenClassrooms. Elle permet aux utilisateurs de s'inscrire, se connecter, puis d'ajouter, modifier et supprimer des livres dans leur bibliothèque personnelle. Les utilisateurs peuvent également noter les livres des autres. Le projet utilise des technologies telles que Node.js, MongoDB et React, et m'a permis de développer mes compétences en développement full-stack tout en offrant une interface intuitive et fluide.",
        "links": [
            {
                "url": "https://github.com/jo8dev/Mon-vieux-grimoire",
                "label": "GitHub"
            }
        ]
    }
]